#HW1
#Завдання 1:
#Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
#Попросіть користувача ввести свсвій вік (можно використати константу або функцію input()).
#- якщо користувачу менше 7 - вивести "Де твої батьки?"
#- якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
#- якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
#- якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) - вивести "Який цікавий вік!"
#- у будь-якому іншому випадку - вивести "А білетів вже немає!"
# Розвязок:

vik = int(input('Введіть свій вік:'))
if vik < 7:
    print('Де твої батьки?')
elif vik % 11 == 0:
    print('Який цікавий вік!')
elif vik < 16:
    print('Це фільм для дорослих!')
elif vik > 65:
    print('Покажіть пенсійне посвідчення!')
else:
    print('А білетів вже немає!')

#Спочатку розвязав таким кодом і думав, як його зробити простішим :)
# vik = int(input('Введіть свій вік:'))
# if vik < 7:
#     print('Де твої батьки?')
# elif vik == 11 or vik == 22 or vik == 33 or vik == 44 or vik == 55 or vik == 66 or vik == 77 or vik == 88 or vik == 99:
#     print('Який цікавий вік!')
# elif vik < 16:
#     print('Це фільм для дорослих!')
# elif vik > 65:
#     print('Покажіть пенсійне посвідчення!')
# else:
#     print('А білетів вже немає!')
